# Задача 27. Задайте строку из набора чисел. Напишите программу, которая покажет большее и меньшее число. В качестве разделителя используйте пробел.

my_str = [1, 2, 3, 4, 5, 6, 7, 8]

print(f'{max(my_str)} - {min(my_str)}')