# Задача 4. Показать первую цифру дробной части числа.

number = 3.1415926535
print(number/10)